spec/fixtures/vcr_cassettes/book_a_paid_session.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100&currency=usd&customer=cus_4ovzcqiLiUoSl7&description=Charge%20for%20userguy1%40email.com%20booking%20Free%20session
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air.att.net 14.0.0 Darwin Kernel Version 14.0.0: Sun Sep  7 19:47:26
        PDT 2014; root:xnu-2782.1.96~4/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '126'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 21 Sep 2014 21:43:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1160'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-01-31'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14fI7c2L7z1ZOsnr2DZ2hXKa",
          "object": "charge",
          "created": 1411335836,
          "livemode": false,
          "paid": true,
          "amount": 100,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_14fI7b2L7z1ZOsnrX5hg9aTB",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "NWaGmOeJgKG5VPPE",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4ovzcqiLiUoSl7",
            "type": "Visa"
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_14fI7c2L7z1ZOsnrVRbOhxrc",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_4ovzcqiLiUoSl7",
          "invoice": null,
          "description": "Charge for userguy1@email.com booking Free session",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null
        }
    http_version: 
  recorded_at: Sun, 21 Sep 2014 21:43:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[name]=Joseph%20Sak&card[number]=4111111111111111&card[exp_month]=1&card[exp_year]=2015&card[cvc]=123&description=userguy1%40email.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air.att.net 14.0.0 Darwin Kernel Version 14.0.0: Sun Sep  7 19:47:26
        PDT 2014; root:xnu-2782.1.96~4/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '138'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 21 Sep 2014 21:45:28 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1342'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-01-31'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1411335928,
          "id": "cus_4ow1EZjsKcIJdn",
          "livemode": false,
          "description": "userguy1@email.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4ow1EZjsKcIJdn/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4ow1EZjsKcIJdn/cards",
            "data": [
              {
                "id": "card_14fI962L7z1ZOsnr2t3AQ2Te",
                "object": "card",
                "last4": "1111",
                "brand": "Visa",
                "funding": "unknown",
                "exp_month": 1,
                "exp_year": 2015,
                "fingerprint": "NWaGmOeJgKG5VPPE",
                "country": "US",
                "name": "Joseph Sak",
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4ow1EZjsKcIJdn",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14fI962L7z1ZOsnr2t3AQ2Te"
        }
    http_version: 
  recorded_at: Sun, 21 Sep 2014 21:45:29 GMT
recorded_with: VCR 2.9.3
